import { ЛогічнийВузел, ПустийВузел, розібрати, ТекстовийВузел, ЧисловийВузел } from "../ісх";

test('швидкий тест', () => {
  const дані = розібрати(`Паспорт(
        прізвище="Когут",
        імʼя="Давид",
        по_батькові="Богданович",
        дата_народження=Дата(
          день=20,
          місяць=1,
          рік=2001
        ),
        застарілий=ні
      )
    `);
  expect(дані).not.toBeNull();
});
describe("числа", () => {
  test('цілі числа', () => {
    const дані = розібрати(`20`);
    expect(дані).toEqual(new ЧисловийВузел(20));
  });
  test('числа із плаваючею точкою', () => {
    const дані = розібрати(`120.2`);
    expect(дані).toEqual(new ЧисловийВузел(120.2));
  });
  test('негативні числа', () => {
    const дані = розібрати(`-20.2`);
    expect(дані).toEqual(new ЧисловийВузел(-20.2));
  });
})

describe("Логічні значення", () => {
  test('так', () => {
    const дані = розібрати(`так`);
    expect(дані).toEqual(new ЛогічнийВузел(true));
  });
  test('ні', () => {
    const дані = розібрати(`ні`);
    expect(дані).toEqual(new ЛогічнийВузел(false));
  });
})

test('пусто', () => {
  const дані = розібрати(`пусто`);
  expect(дані).toBe(ПустийВузел.екземпляр);
  expect(дані).toBe(ПустийВузел.instance);
});

describe("Текстові рядки", () => {
  test('звичайна строка', () => {
    const дані = розібрати(`"Привіт від Лесі!"`);
    expect(дані).toEqual(new ТекстовийВузел("Привіт від Лесі!"));
  });
  test('екрановані символи', () => {
    const дані = розібрати(`"\n\r"`);
    expect(дані).toEqual(new ТекстовийВузел("\n\r"));
  });
})