import { ВузелЗаписуОбʼекта, ВузелЗаписуСловника, ВузелСловника, ВузелСписка, ЛогічнийВузел, ОбʼектнийВузел, ПустийВузел, розібрати, ТекстовийВузел, ЧисловийВузел } from "../ісх";

const тест = test;
const птест = xtest;
const описати = describe;

тест('швидкий тест', () => {
  const дані = розібрати(`Паспорт(
        прізвище="Когут",
        імʼя="Давид",
        по_батькові="Богданович",
        дата_народження=Дата(
          день=20,
          місяць=1,
          рік=2001
        ),
        застарілий=ні
      )
    `);
  expect(дані).not.toBeNull();
});
описати("числа", () => {
  тест('цілі числа', () => {
    const дані = розібрати(`20`);
    expect(дані).toEqual(new ЧисловийВузел(20));
  });
  тест('числа із плаваючею точкою', () => {
    const дані = розібрати(`120.2`);
    expect(дані).toEqual(new ЧисловийВузел(120.2));
  });
  тест('негативні числа', () => {
    const дані = розібрати(`-20.2`);
    expect(дані).toEqual(new ЧисловийВузел(-20.2));
  });
  тест('негативні числа із пробелом', () => {
    expect(() => розібрати(`- 20.2`)).toThrow("");
    //expect(дані).toEqual(new ЧисловийВузел(-20.2));
  });
})

описати("Логічні значення", () => {
  тест('так', () => {
    const дані = розібрати(`так`);
    expect(дані).toEqual(new ЛогічнийВузел(true));
  });
  тест('ні', () => {
    const дані = розібрати(`ні`);
    expect(дані).toEqual(new ЛогічнийВузел(false));
  });
})

тест('пусто', () => {
  const дані = розібрати(`пусто`);
  expect(дані).toBe(ПустийВузел.екземпляр);
  expect(дані).toBe(ПустийВузел.instance);
});

описати("Текстові рядки", () => {
  тест('звичайна строка', () => {
    const дані = розібрати(`"Привіт від Лесі!"`);
    expect(дані).toEqual(new ТекстовийВузел("Привіт від Лесі!"));
  });
  тест('екрановані символи', () => {
    const дані = розібрати("\"\\n\\r\"");
    expect(дані).toEqual(new ТекстовийВузел("\n\r"));
  });
})

описати("Обʼектні дані", () => {
  тест('типовий обʼект', () => {
    const дані = розібрати(`Паспорт(
      прізвище="Когут",
      імʼя="Давид",
      по_батькові="Богданович",
      дата_народження=Дата(
        день=20,
        місяць=1,
        рік=2001
      ),
      борг=пусто,
      застарілий=ні
    )`);
    expect(дані).toEqual(new ОбʼектнийВузел("Паспорт", [
      new ВузелЗаписуОбʼекта("прізвище", new ТекстовийВузел("Когут")),
      new ВузелЗаписуОбʼекта("імʼя", new ТекстовийВузел("Давид")),
      new ВузелЗаписуОбʼекта("по_батькові", new ТекстовийВузел("Богданович")),
      new ВузелЗаписуОбʼекта("дата_народження", new ОбʼектнийВузел("Дата", [
        new ВузелЗаписуОбʼекта("день", new ЧисловийВузел(20)),
        new ВузелЗаписуОбʼекта("місяць", new ЧисловийВузел(1)),
        new ВузелЗаписуОбʼекта("рік", new ЧисловийВузел(2001)),
      ])),
      new ВузелЗаписуОбʼекта("борг", ПустийВузел.екземпляр),
      new ВузелЗаписуОбʼекта("застарілий", new ЛогічнийВузел(false)),
    ]));
  });
  тест('обʼект із назвою так', () => {
    const дані = розібрати(`так(
      прізвище="Когут",
    )`);
    expect(дані).toEqual(new ОбʼектнийВузел("так", [
      new ВузелЗаписуОбʼекта("прізвище", new ТекстовийВузел("Когут")),
    ]));
  });
  тест('обʼект із назвою ні', () => {
    const дані = розібрати(`ні(
      прізвище="Когут",
    )`);
    expect(дані).toEqual(new ОбʼектнийВузел("ні", [
      new ВузелЗаписуОбʼекта("прізвище", new ТекстовийВузел("Когут")),
    ]));
  });
  тест('обʼект із назвою пусто', () => {
    const дані = розібрати(`пусто(
      прізвище="Когут",
    )`);
    expect(дані).toEqual(new ОбʼектнийВузел("пусто", [
      new ВузелЗаписуОбʼекта("прізвище", new ТекстовийВузел("Когут")),
    ]));
  });
  тест('пропуск коми дає помилку', () => {
    expect(() => розібрати(`Людина(
      прізвище="Когут"
      імʼя="Давид"
    )`)).toThrow("Очікувалася кома. На рядку 3 стовпець 7 знаходиься 'імʼя'");
  });
})

описати("Список", () => {
  тест('типовий обʼект', () => {
    const дані = розібрати(`[1, -2, 3.14, "привіт", Людина(імʼя="Давид"), ["2211"]]`);
    expect(дані).toEqual(new ВузелСписка([
      new ЧисловийВузел(1),
      new ЧисловийВузел(-2),
      new ЧисловийВузел(3.14),
      new ТекстовийВузел("привіт"),
      new ОбʼектнийВузел("Людина", [
        new ВузелЗаписуОбʼекта("імʼя", new ТекстовийВузел("Давид")),
      ]),
      new ВузелСписка([new ТекстовийВузел("2211")]),
    ]));
  });
  тест('пропуск коми дає помилку', () => {
    expect(() => розібрати(`[1, -2, 3.14, "привіт" Людина(імʼя="Давид"), ["2211"]]`))
      .toThrow("Очікувалася кома. На рядку 1 стовпець 24 знаходиься 'Людина'");
  });
})

описати("Словник", () => {
  тест('типовий обʼект', () => {
    const дані = розібрати(`(а=2, "б"="2", в=[], г=(), Ґ=Книжка(), 999=238)`);
    expect(дані).toEqual(new ВузелСловника([
      new ВузелЗаписуСловника(new ТекстовийВузел("а"), new ЧисловийВузел(2)),
      new ВузелЗаписуСловника(new ТекстовийВузел("б"), new ТекстовийВузел("2")),
      new ВузелЗаписуСловника(new ТекстовийВузел("в"), new ВузелСписка([])),
      new ВузелЗаписуСловника(new ТекстовийВузел("г"), new ВузелСловника([])),
      new ВузелЗаписуСловника(new ТекстовийВузел("Ґ"), new ОбʼектнийВузел("Книжка", [])),
      new ВузелЗаписуСловника(new ЧисловийВузел(999), new ЧисловийВузел(238)),
    ]));
  });
  тест('пропуск коми дає помилку', () => {
    expect(() => розібрати(`(а=2, "б"="2", є=[] Ї=(), Ґ=Книжка(), 999=238)`))
      .toThrow("Очікувалася кома. На рядку 1 стовпець 21 знаходиься 'Ї'");
  });
})